rpi5-64/20240731-0847-glibc-default/logs/index-yes-0-1000-10/pgbench.log
pgbench (18devel)
transaction type: /mnt/data/lock-scalability-test/20240731-0847-glibc-default/logs/index-yes-0-1000-10/index.sql
scaling factor: 1
query mode: prepared
number of clients: 8
number of threads: 8
maximum number of tries: 1
duration: 10 s
number of transactions actually processed: 640928
number of failed transactions: 0 (0.000%)
latency average = 0.125 ms
initial connection time = 9.573 ms
tps = 64146.965698 (without initial connection time)